def func(a : int):
    sotie = {
        1 : "Сто",
        2 : "Двести",
        3 : "Триста",
        4 : "Четыреста",
        5 : "Пятььсот",
        6 : "Шестьсот",
        7 : "Семьсот",
        8 : "Шестьсот",
        9 : "Девятьсот",
        0 : ""
    }
    desytie = {
        2 : "Двадцать",
        3 : "Тридцать",
        4 : "Сорок",
        5 : "Пятьдесят",
        6 : "Шестьдесят",
        7 : "Семьдесят",
        8 : "Восемьдесят",
        9 : "Девяносто",
        0 : ""
    }
    edenici = {
        1 : "Один",
        2 : "Два", 
        3 : "Три", 
        4 : "Четыре",
        5 : "Пять",
        6 : "Шесть",
        7 : "Семь",
        8 : "Восемь",
        9 : "Девять",
        0 : ""
    }
    edenici_decytie = {
        10 : "Десять",
        11 : "Одиннадцать",
        12 : "Двенадцать",
        13 : "Тринадцать",
        14 : "Четырнадцать",
        15 : "Пятнадцать",
        16 : "Шетсьнадцать",
        17 : "Семьнадцать",
        18 : "Восемьнадцать",
        19 : "Девятнадцать"
    }
    if int(str(a)[1 : 3]) < 20 and int(str(a)[1 : 3]) > 9:
        return sotie[int(str(a)[0])] + " " + edenici_decytie[int(str(a)[1 : 3])]
    else: 
        return sotie[int(str(a)[0])] + " " + desytie[int(str(a)[1])] + " " + edenici[int(str(a)[2])]

print(func(321))